GlomarGadaffi/ESP32_AdBlocker_Reborn/main/dns_sink.cpp
/*
 * dns_sink.cpp — ESP-IDF entry point for the DNS sinkhole.
 *
 * W5500 Ethernet bringup (SPI2, event-group DHCP wait). The W5500 + SD pin
 * map is selected per board via the ADBLOCK_BOARD Kconfig choice: LilyGO
 * T-ETH-Elite (default) or Waveshare ESP32-S3-ETH.
 */

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/event_groups.h"
#include "freertos/semphr.h"

#include "esp_system.h"
#include "esp_event.h"
#include "esp_log.h"
#include "esp_idf_version.h"
#if CONFIG_ADBLOCK_NET_ETH
#include "esp_eth.h"
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
#include "esp_eth_mac_w5500.h"
#include "esp_eth_phy_w5500.h"
#endif
#endif
#if CONFIG_ADBLOCK_NET_WIFI
#include "esp_wifi.h"
#endif
#include "esp_netif.h"
#include "nvs_flash.h"
#include "nvs.h"
#include "esp_ota_ops.h"
#include "esp_mac.h"
#include "esp_random.h"
#include "esp_timer.h"
#include "esp_attr.h"
#include "lwip/inet.h"

#include "driver/gpio.h"
#include "driver/spi_master.h"

#include <atomic>

#include "esp_vfs_fat.h"
#include "sdmmc_cmd.h"
#include "driver/sdspi_host.h"
#include <inttypes.h>

#include "blocklist.h"
#include "domain.h"
#include "rewrite.h"
#include "acl.h"
#include "bypass.h"
#include "pause.h"
#include "dot.h"
#include "localzone.h"
#include "query_log.h"
#include "crashlog.h"
#include "timesync.h"
#include "dns_server.h"
#include "web_ui.h"
#include "console.h"
#include "mdns.h"
#include <cstring>
#include <cstdlib>
#include <cstdio>
#include <ctime>

static const char *TAG = "dns_sink";

#if CONFIG_ADBLOCK_BOARD_GENERIC_S3_WIFI

/* ── Generic ESP32-S3 dev board, Wi-Fi only (#49) ─────────────────
 * No W5500, no SD slot: nothing here but the identity. Every Ethernet/SD
 * pin map, the esp_eth bring-up, the L2 RX hook and the SD mount are
 * compiled out under !CONFIG_ADBLOCK_NET_ETH. Same default hostname as
 * the Elite — for a household that has exactly one unit, which is who
 * this target is for — so the README's esp32adblock.local just works. */
#define BOARD_NAME    "Generic ESP32-S3 (Wi-Fi)"
#define MDNS_HOSTNAME "esp32adblock"

#elif CONFIG_ADBLOCK_BOARD_WAVESHARE_S3_ETH

/* ── Pin maps: Waveshare ESP32-S3-ETH (ESP32-S3R8 + W5500) ──────── */
#define BOARD_NAME    "Waveshare ESP32-S3-ETH"
/* Distinct mDNS hostname — a T-ETH-Elite unit on the same LAN already
 * claims esp32adblock.local. */
#define MDNS_HOSTNAME "esp32adblock2"

/* TF slot, SPI mode (CS=DAT3, MISO=DAT0, MOSI=CMD). Pins from the
 * CircuitPython board definition; a card has not yet been tested in this
 * slot — a wrong pin here just fails the mount and falls back to download. */
#define SD_MISO_GPIO  5
#define SD_MOSI_GPIO  6
#define SD_SCLK_GPIO  7
#define SD_CS_GPIO    4
#define SD_SPI_HOST   SPI3_HOST
#define SD_MOUNT      "/sdcard"

#define W5500_SCLK_GPIO  13
#define W5500_MISO_GPIO  12
#define W5500_MOSI_GPIO  11
#define W5500_CS_GPIO    14
#define W5500_INT_GPIO   10
#define W5500_RST_GPIO   9   /* real hardware reset line (the Elite has none) */
#define W5500_SPI_HOST   SPI2_HOST
/* Also GPIO-matrix pins (SCLK=13 ≠ FSPICLK=12, so no IO_MUX), same regime the
 * Elite proved 40 MHz in. If w5500_reset aborts at boot, drop to 25. */
#define W5500_SPI_CLOCK  40

#else /* CONFIG_ADBLOCK_BOARD_T_ETH_ELITE */

#define BOARD_NAME    "LilyGO T-ETH-Elite"
#define MDNS_HOSTNAME "esp32adblock"

/* ── SD card pin map: LilyGO T-ETH-ELITE S3 ─────────────────────── */
#define SD_MISO_GPIO  9
#define SD_MOSI_GPIO  11
#define SD_SCLK_GPIO  10
#define SD_CS_GPIO    12
#define SD_SPI_HOST   SPI3_HOST
#define SD_MOUNT      "/sdcard"

/* ── W5500 pin map: LilyGO T-ETH-ELITE S3 ──────────────────────── */
#define W5500_SCLK_GPIO  48
#define W5500_MISO_GPIO  47
#define W5500_MOSI_GPIO  21
#define W5500_CS_GPIO    45
#define W5500_INT_GPIO   14
#define W5500_RST_GPIO   -1
#define W5500_SPI_HOST   SPI2_HOST
/* SPI clock (MHz). W5500 is on GPIO-matrix pins (48/47/21/45), not the S3
 * IO_MUX FSPI pins (those are wired to the SD card), so the matrix MISO-sampling
 * delay caps it: 80 hard-fails w5500_reset. 60 is stable but measured IDENTICAL
 * latency/qps to 40 (per-query cost is transaction overhead, not clocking), so
 * we stay at the proven-safe 40 — what survives sustained full-duplex load. */
#define W5500_SPI_CLOCK  40

#endif /* board select */

/* ── Event group ─────────────────────────────────────────────────── */
#define ETH_CONNECTED_BIT   BIT0
#define ETH_GOT_IP_BIT      BIT1
#define WIFI_CONNECTED_BIT  BIT2
#define WIFI_GOT_IP_BIT     BIT3
static EventGroupHandle_t s_eth_eg = nullptr;
/* (#106) The same Ethernet address as s_ip, kept in binary (network byte
 * order) because the L2 RX hook has to compare it against every frame's
 * destination and must not parse a string there. 0 = no address yet, which
 * makes the hook defer everything to lwIP. */
static std::atomic<uint32_t> s_eth_ip_nbo{0};
static char               s_ip[16] = {};      /* Ethernet IP — the LAN-facing address, reported to clients/mDNS/web UI */
static char               s_nm[16] = {};      /* Ethernet netmask */
static char               s_gw[16] = {};      /* Ethernet DHCP gateway */
static char               s_eth_dns[16] = {}; /* Ethernet DHCP-provided DNS server (option 6) — the real upstream target */
#if CONFIG_ADBLOCK_NET_WIFI
static char               s_wifi_ip[16] = {};
static char               s_wifi_nm[16] = {};   /* Wi-Fi netmask */
static char               s_wifi_gw[16] = {};   /* Wi-Fi DHCP gateway */
static char               s_wifi_dns[16] = {};  /* Wi-Fi DHCP-provided DNS server — see s_eth_dns */
#endif

/* ── Global singletons ───────────────────────────────────────────── */
static DnsSinkServer s_dns;
static volatile bool s_reload_requested = false;

/* Called from web_ui.cpp POST /reload */
extern "C" void dns_sink_trigger_reload(void)
{
    s_reload_requested = true;
}

/* ── Dual-WAN upstream-interface selection (#53) ──────────────────────────
 * Which interface's gateway egresses upstream resolver queries (persisted in
 * NVS so it survives reboot). Listening on port 53 already happens on every
 * up interface (client socket binds INADDR_ANY) — this only steers the
 * *outbound* forwarding socket, via lwIP's subnet-based routing: sending to
 * a gateway IP that only one netif's subnet contains routes out that netif
 * automatically, no explicit interface binding needed. */
#define NVS_NS       "dns_sink"
#define NVS_KEY_UPIF "up_if"
static char s_upstream_iface[8] = "eth";   /* "eth" or "wifi" */

/* #80: how long to let the SELECTED upstream interface finish DHCP before
 * giving up and starting on the fallback resolver. Long enough for a normal
 * lease, short enough that a cable-out boot is not visibly stalled. */
#define UPSTREAM_IFACE_WAIT_MS 5000

