GlomarGadaffi/ESP32_AdBlocker_Reborn/main/dns_sink.cpp
    snprintf(s_wifi_ssid, sizeof(s_wifi_ssid), "%s", ssid);
    snprintf(s_wifi_pass, sizeof(s_wifi_pass), "%s", pass ? pass : "");

    nvs_handle_t h;
    if (nvs_open(NVS_NS, NVS_READWRITE, &h) == ESP_OK) {
        nvs_set_str(h, "wifi_ssid", s_wifi_ssid);
        nvs_set_str(h, "wifi_pass", s_wifi_pass);
        nvs_commit(h);
        nvs_close(h);
    }

    xTaskCreate(wifi_apply_reconfigure_task, "wifi_recfg", 3072, nullptr, 3, nullptr);
    return true;
}

extern "C" bool dns_sink_setup_ap_active(void) { return s_setup_ap_active; }
extern "C" void dns_sink_setup_ap_passphrase(char *out, size_t cap) { setup_ap_passphrase(out, cap); }
#else
extern "C" void dns_sink_wifi_get_ssid(char *out, size_t cap) { if (cap) out[0] = '\0'; }
extern "C" bool dns_sink_wifi_scan_start(void) { return false; }
extern "C" int  dns_sink_wifi_scan_get(char *out, size_t cap)
{
    return snprintf(out, cap, "{\"state\":\"idle\",\"age_s\":-1,\"aps\":[]}");
}
extern "C" bool dns_sink_wifi_set_creds(const char *, const char *) { return false; }
extern "C" bool dns_sink_setup_ap_active(void) { return false; }
extern "C" void dns_sink_setup_ap_passphrase(char *out, size_t cap) { if (cap) out[0] = '\0'; }
#endif

/* Full mDNS name — the TLS certificate's CN/SAN (web_tls.c) and the console's
 * "browse to" hints. */
extern "C" const char *dns_sink_hostname(void) { return MDNS_HOSTNAME ".local"; }

/* This device's current LAN-facing address, Ethernet preferred (matches the
 * dashboard's own precedence at line ~1407) — used by the :80 redirect
 * handler (#112) to validate the Host header before echoing it back. */
extern "C" const char *dns_sink_lan_ip(void) { return s_ip[0] ? s_ip : s_wifi_ip; }

/* ── W5500 init (board pin map selected above) ───────────────────── */
#if CONFIG_ADBLOCK_NET_ETH
static esp_eth_handle_t eth_init_w5500(void)
{
    ESP_LOGI(TAG, "W5500 %s: SCLK=%d MISO=%d MOSI=%d CS=%d INT=%d RST=%d @ %d MHz",
             BOARD_NAME, W5500_SCLK_GPIO, W5500_MISO_GPIO, W5500_MOSI_GPIO,
             W5500_CS_GPIO, W5500_INT_GPIO, W5500_RST_GPIO, W5500_SPI_CLOCK);

    spi_bus_config_t buscfg = {};
    buscfg.miso_io_num   = W5500_MISO_GPIO;
    buscfg.mosi_io_num   = W5500_MOSI_GPIO;
    buscfg.sclk_io_num   = W5500_SCLK_GPIO;
    buscfg.quadwp_io_num = -1;
    buscfg.quadhd_io_num = -1;
    ESP_ERROR_CHECK(spi_bus_initialize(W5500_SPI_HOST, &buscfg, SPI_DMA_CH_AUTO));

    spi_device_interface_config_t devcfg = {};
    devcfg.command_bits   = 16;  /* W5500: 16-bit address phase */
    devcfg.address_bits   = 8;   /* 8-bit control phase */
    devcfg.mode           = 0;
    devcfg.clock_speed_hz = W5500_SPI_CLOCK * 1000 * 1000;
    devcfg.spics_io_num   = W5500_CS_GPIO;
    devcfg.queue_size     = 20;

#if W5500_INT_GPIO >= 0
    /* GPIO ISR service needed for W5500 interrupt pin (not auto-installed in IDF v6) */
    esp_err_t rc = gpio_install_isr_service(0);
    if (rc != ESP_OK && rc != ESP_ERR_INVALID_STATE) ESP_ERROR_CHECK(rc);
#endif

    eth_w5500_config_t w5500_cfg = ETH_W5500_DEFAULT_CONFIG(W5500_SPI_HOST, &devcfg);
    w5500_cfg.int_gpio_num = static_cast<gpio_num_t>(W5500_INT_GPIO);

    eth_mac_config_t mac_cfg = ETH_MAC_DEFAULT_CONFIG();
    esp_eth_mac_t *mac = esp_eth_mac_new_w5500(&w5500_cfg, &mac_cfg);

    eth_phy_config_t phy_cfg = ETH_PHY_DEFAULT_CONFIG();
    phy_cfg.autonego_timeout_ms = 0;
    phy_cfg.reset_gpio_num      = static_cast<gpio_num_t>(W5500_RST_GPIO);
    esp_eth_phy_t *phy = esp_eth_phy_new_w5500(&phy_cfg);

    esp_eth_config_t eth_cfg = ETH_DEFAULT_CONFIG(mac, phy);
    esp_eth_handle_t handle  = nullptr;
    ESP_ERROR_CHECK(esp_eth_driver_install(&eth_cfg, &handle));

    uint8_t mac_addr[6];
    esp_read_mac(mac_addr, ESP_MAC_ETH);
    ESP_ERROR_CHECK(esp_eth_ioctl(handle, ETH_CMD_S_MAC_ADDR, mac_addr));

    return handle;
}

/* ── SD card mount (SPI3, separate bus from W5500) ───────────────── */
static sdmmc_card_t *s_sd_card = nullptr;

static void sd_mount(void)
{
    sdmmc_host_t host = SDSPI_HOST_DEFAULT();
    host.slot = SD_SPI_HOST;

    spi_bus_config_t bus = {};
    bus.mosi_io_num   = SD_MOSI_GPIO;
    bus.miso_io_num   = SD_MISO_GPIO;
    bus.sclk_io_num   = SD_SCLK_GPIO;
    bus.quadwp_io_num = -1;
    bus.quadhd_io_num = -1;

    esp_err_t rc = spi_bus_initialize(SD_SPI_HOST, &bus, SDSPI_DEFAULT_DMA);
    if (rc != ESP_OK) { ESP_LOGW(TAG, "SD SPI bus init failed: %d", rc); return; }

    sdspi_device_config_t slot = SDSPI_DEVICE_CONFIG_DEFAULT();
    slot.gpio_cs  = static_cast<gpio_num_t>(SD_CS_GPIO);
    slot.host_id  = SD_SPI_HOST;

    esp_vfs_fat_sdmmc_mount_config_t mcfg = {};
    mcfg.format_if_mount_failed = false;
    mcfg.max_files              = 4;
    mcfg.allocation_unit_size   = 16 * 1024;

    /* SD-over-SPI init is occasionally flaky (ESP_ERR_INVALID_RESPONSE on the
     * probe). Retry a few times before giving up and falling back to download. */
    for (int attempt = 1; attempt <= 4; attempt++) {
        rc = esp_vfs_fat_sdspi_mount(SD_MOUNT, &host, &slot, &mcfg, &s_sd_card);
        if (rc == ESP_OK) {
            ESP_LOGI(TAG, "SD mounted (attempt %d): %lluMB", attempt,
                     (uint64_t)s_sd_card->csd.capacity * s_sd_card->csd.sector_size / (1024*1024));
            return;
        }
        ESP_LOGW(TAG, "SD mount attempt %d/4 failed: %s", attempt, esp_err_to_name(rc));
        vTaskDelay(pdMS_TO_TICKS(250));
    }
    ESP_LOGW(TAG, "SD mount failed after retries — no SD cache");
    spi_bus_free(SD_SPI_HOST);
}
#endif /* CONFIG_ADBLOCK_NET_ETH — W5500 + SD bring-up */

/* ── Blocklist download task (Core 0, priority 2) ────────────────── */
static void download_task(void *)
{
    /* Boot: try flash first (#70 — instant, needs no SD card, works on every
     * board including the Wi-Fi-only #49 target), then SD, before ever
     * downloading. Either hit means DO NOT re-download on every boot — that
     * wastes ~230s of bandwidth and opens a sort null-window. The 4h-reload
     * timer (or manual /reload) refreshes either way. */
    bool from_flash = blocklist_load_flash();
    bool from_sd    = from_flash ? false : blocklist_load_sd();
    if (!from_flash && !from_sd) {
        /* #75: this is the first TLS client on a cold boot, and now that
         * certificate dates are actually checked (CONFIG_MBEDTLS_HAVE_TIME_DATE)
         * it wants real time, not the floor. The floor is a lower bound and can
         * be stale — an image flashed months after it was built floors months
         * back, and a certificate issued since then reads as not-yet-valid.
         * Waiting a few seconds turns that corner from fail-then-retry into
         * simply succeeding. Bounded, and NOT fatal: with no NTP reachable at
         * all we go ahead on the floor, which is exactly what the floor is for.
         * Only the no-SD-cache path pays this; an SD boot skips the fetch. */
        if (!timesync_wait_synced(10000))
            ESP_LOGW(TAG, "Clock still unsynced after 10s — fetching on the %s "
                          "clock floor; a certificate issued since then will be "
                          "rejected until NTP lands", timesync_source());

        ESP_LOGI(TAG, "No cached blocklist (flash or SD) — downloading...");
        /* Retry with backoff (#57). blocklist_load() returns the domain count,
         * so 0 means the fetch failed; that used to be discarded, leaving the
         * sinkhole with an empty list — every query ALLOWED, silently — until
         * the next 4h reload. Most boot failures are just the network not being
         * ready yet, so a few spaced retries recover without waiting hours. */
        static const int retry_delay_s[] = { 15, 60, 300 };
        if (blocklist_load() == 0) {
            for (size_t i = 0; i < sizeof(retry_delay_s) / sizeof(retry_delay_s[0]); i++) {
                ESP_LOGW(TAG, "Boot blocklist download failed — retry %u/%u in %ds",
                         (unsigned)(i + 1),
                         (unsigned)(sizeof(retry_delay_s) / sizeof(retry_delay_s[0])),
                         retry_delay_s[i]);
                vTaskDelay(pdMS_TO_TICKS(retry_delay_s[i] * 1000));
                if (blocklist_load() > 0) break;
            }
            if (blocklist_domain_count() == 0)
                ESP_LOGE(TAG, "Blocklist still empty after retries — NOT blocking "
                              "until the next 4h reload or a manual /reload");
        }
    } else {
        ESP_LOGI(TAG, "%s cache active (%" PRIu32 " domains) — skipping boot refresh",
                 from_flash ? "Flash" : "SD", blocklist_domain_count());
    }
    ESP_LOGI(TAG, "download_task stack hwm: %u bytes free",
             (unsigned)uxTaskGetStackHighWaterMark(NULL));

    /* Reload every 4h on a fixed cadence. Scheduling itself stays on the
     * monotonic esp_timer (immune to NTP re-sync jumps — see L3, where an
     * absolute-wall-clock "sleep then reload" loop drifted); NTP wall-clock
     * (timesync_epoch()) is used only to log a real timestamp, once synced.
     * Use an absolute deadline advanced by exactly one interval each cycle
     * (next += interval) so the download/sort duration never pushes the
     * schedule later. A manual /reload fires immediately without shifting it. */
    const int64_t interval_us = 4LL * 60 * 60 * 1000000;  /* 4h */
    int64_t next_us = esp_timer_get_time() + interval_us;

    /* Forward-cache warm-boot snapshots (#79). First save at +2min so a
     * reboot-after-power-blip keeps the working set the box just rebuilt,
     * then every 20min. Deliberately "now + period" rather than an advancing
     * absolute deadline: blocklist_load() can block this task for minutes,
     * and a missed save should simply resume the cadence, not fire the moment
     * the download returns. */
    const int64_t save_first_us  =  2LL * 60 * 1000000;
    const int64_t save_period_us = 20LL * 60 * 1000000;
    int64_t next_save_us = esp_timer_get_time() + save_first_us;
    for (;;) {
        /* #75: persist the clock as the next boot's floor. Self-rate-limiting
         * (~10 min, plus once promptly after each sync) and a no-op until NTP
         * has landed, so calling it every second costs a load and a compare.
         * It lives here rather than in the SNTP callback because it writes
         * flash and that callback runs in the tcpip task. */
        timesync_persist_tick();

        int64_t now_us = esp_timer_get_time();
        if (now_us >= next_us) {
            if (timesync_is_synced()) {
                time_t epoch = (time_t)timesync_epoch();
                char ts[32]; struct tm tmv; gmtime_r(&epoch, &tmv);
                strftime(ts, sizeof(ts), "%Y-%m-%d %H:%M:%S UTC", &tmv);
                ESP_LOGI(TAG, "4h reload (%s)...", ts);
            } else {
                ESP_LOGI(TAG, "4h reload (clock not yet synced)...");
            }
            blocklist_load();
            next_us += interval_us;
            if (next_us <= esp_timer_get_time())     /* fell behind — catch up */
                next_us = esp_timer_get_time() + interval_us;
            continue;
        }
        if (s_reload_requested) {
            s_reload_requested = false;
            ESP_LOGI(TAG, "Manual reload...");
            blocklist_load();   /* does not shift the 4h deadline */
            continue;
        }
        if (now_us >= next_save_us) {
            dns_server_cache_save();                                  /* #79 */
            next_save_us = esp_timer_get_time() + save_period_us;
            continue;
        }
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

/* ── L2 fast-path RX hook ────────────────────────────────────────────
 * Overrides the eth driver's stack-input. Blocked DNS A/AAAA queries are
 * answered here (craft frame + esp_eth_transmit) WITHOUT touching lwIP —
 * removing the ~1.5ms socket/stack overhead from the sinkhole hot path.
 * Everything else passes through to lwIP unchanged (DHCP, httpd, forwarding,
 * cache, allowed queries). Runs single-threaded in the eth RX task. */
static uint32_t s_l2_blocked = 0;   /* L2-handled blocked queries (bypassed lwIP) */
static uint32_t s_l2_cached  = 0;   /* L2-handled forward-cache hits (bypassed lwIP) */
static uint32_t s_l2_tx_fail = 0;   /* esp_eth_transmit() refused a fast-path reply (#101) */
/* (#77) Every frame the hook hands to lwIP unanswered — DNS or not. Proof the
 * *link* is alive and frames are arriving, independent of whether dns_task's
 * own sockets are making any progress: the socket-path watchdog in
 * dns_server.cpp compares this counter's movement against its own query
 * counter to tell "link down, nothing to do" apart from "link fine, queries
 * arriving, dns_task's sockets are wedged." Only incremented on Ethernet
 * boards (this hook doesn't exist on the Wi-Fi-only build); the getter below
 * is unconditional so dns_server.cpp needs no #ifdef to call it. */
static uint32_t s_l2_fallthrough = 0;
extern "C" uint32_t dns_sink_l2_tx_fail(void) { return s_l2_tx_fail; }
extern "C" uint32_t dns_sink_l2_blocked(void) { return s_l2_blocked; }
extern "C" uint32_t dns_sink_l2_cached(void)  { return s_l2_cached; }
extern "C" uint32_t dns_sink_l2_fallthrough(void) { return s_l2_fallthrough; }

/* Query-log staging ring (feature request, 2026-09-06): l2_input_cb answers
 * most blocked/cached queries on Ethernet boards WITHOUT ever calling
 * query_log_record() — that function lives in flash and isn't IRAM_ATTR, so
 * calling it directly from this hot path would risk exactly the "must never
 * fault to flash" hazard CONTRIBUTING.md §4 warns about. Bypassing it
 * entirely was the original tradeoff (#78's comment: "the hook's cheaper
 * check set is not a divergence"), but it meant the query log, top-lists,
 * per-minute history, and #71's crash-log breadcrumb were all blind to the
 * MAJORITY of blocked traffic on Ethernet boards (measured live on .244:
 * l2_blocked outnumbers the socket path's own blocked count roughly 6:1).
 *
 * Fix: a small lock-free SPSC ring, internal RAM (not PSRAM — this hook's
 * scratch stays internal per CONTRIBUTING.md §3a, for latency, not just
 * flash-safety). l2_input_cb (producer, IRAM_ATTR) stages a raw record with
 * a few atomic ops and a memcpy — no snprintf, no flash. dns_task (consumer,
 * not IRAM-constrained) drains it on its existing per-tick housekeeping and
 * calls the real query_log_record() for each entry, which is where
 * crashlog_record() already lives — so this closes the #71 blind spot too,
 * for free, the same "fix once, reuse everywhere" shape as this session's
 * pause/bypass work. Ring full (a burst beyond what the tick-rate drain can
 * keep up with) drops and counts rather than blocking or overwriting — the
 * L2 hook must never stall waiting on dns_task.
 *
 * Guarded under CONFIG_ADBLOCK_NET_ETH (review, #124 follow-up): unlike the
 * 4-byte scalar counters just above — cheap enough to leave unconditional so
 * dns_server.cpp needs no #ifdef — this ring is ~2.3 KB of internal .bss
 * (L2LOG_RING=32 entries) whose only producer, l2_log_stage(), is only ever
 * called from l2_input_cb below, itself already gated. Leaving the ring
 * unconditional would burn that RAM on the Wi-Fi-only build, which has no L2
 * hook at all, against CONTRIBUTING.md §3a's "internal RAM is the scarce
 * resource" rule. The #else stub keeps dns_server.cpp's drain call
 * unconditional the same way the scalar getters are. */
#if CONFIG_ADBLOCK_NET_ETH
#define L2LOG_RING 32
typedef struct {
    char     domain[64];
    uint32_t client_ip;   /* host byte order */
    uint16_t qtype;
    bool     blocked;     /* false = l2_cached (an allowed answer) */
} L2LogEntry;
static L2LogEntry            s_l2log[L2LOG_RING];
static std::atomic<uint32_t> s_l2log_head{0};   /* producer-owned (eth RX task) */
static std::atomic<uint32_t> s_l2log_tail{0};   /* consumer-owned (dns_task) */
static std::atomic<uint32_t> s_l2log_dropped{0}; /* producer increments, httpd task reads */

