GlomarGadaffi/ESP32_AdBlocker_Reborn/main/dns_sink.cpp
static void IRAM_ATTR l2_log_stage(const char *name, size_t nlen, uint16_t qtype,
                                   uint32_t client_ip_hbo, bool blocked)
{
    uint32_t head = s_l2log_head.load(std::memory_order_relaxed);
    uint32_t tail = s_l2log_tail.load(std::memory_order_acquire);
    /* Ring full: drop and count, never block or overwrite — the L2 hook must
     * never stall waiting on dns_task. A nonzero l2_log_dropped means a burst
     * outran the ~100ms drain rate for that window, not a bug; which specific
     * queries were lost isn't recorded, only the count. */
    if (head - tail >= L2LOG_RING) {
        s_l2log_dropped.fetch_add(1, std::memory_order_relaxed);
        return;
    }
    L2LogEntry *e = &s_l2log[head % L2LOG_RING];
    size_t cl = nlen < sizeof(e->domain) - 1 ? nlen : sizeof(e->domain) - 1;
    memcpy(e->domain, name, cl);
    e->domain[cl] = '\0';
    e->client_ip = client_ip_hbo;
    e->qtype = qtype;
    e->blocked = blocked;
    s_l2log_head.store(head + 1, std::memory_order_release);
}

/* Consumer, called from dns_task: pulls one staged entry, if any. Returns
 * false when the ring is empty. Not IRAM_ATTR — dns_task isn't flash-
 * constrained the way the L2 hook is. */
extern "C" bool dns_sink_l2log_drain(char *domain_out, size_t domain_cap,
                                     uint16_t *qtype_out, uint32_t *client_ip_out,
                                     bool *blocked_out)
{
    uint32_t tail = s_l2log_tail.load(std::memory_order_relaxed);
    uint32_t head = s_l2log_head.load(std::memory_order_acquire);
    if (tail == head) return false;
    L2LogEntry *e = &s_l2log[tail % L2LOG_RING];
    size_t cl = strnlen(e->domain, sizeof(e->domain));
    if (cl >= domain_cap) cl = domain_cap - 1;
    memcpy(domain_out, e->domain, cl);
    domain_out[cl] = '\0';
    *qtype_out = e->qtype;
    *client_ip_out = e->client_ip;
    *blocked_out = e->blocked;
    s_l2log_tail.store(tail + 1, std::memory_order_release);
    return true;
}
extern "C" uint32_t dns_sink_l2log_dropped(void) { return s_l2log_dropped.load(std::memory_order_relaxed); }
#else  /* !CONFIG_ADBLOCK_NET_ETH — no L2 hook, so no producer ever stages anything */
extern "C" bool dns_sink_l2log_drain(char *, size_t, uint16_t *, uint32_t *, bool *) { return false; }
extern "C" uint32_t dns_sink_l2log_dropped(void) { return 0; }
#endif /* CONFIG_ADBLOCK_NET_ETH — L2 query-log staging ring */

/* (#109) The question-qname parser that used to live here (l2_qname) is now
 * dns_extract_qname() in domain.c/.h, shared with dns_server.cpp's socket
 * path — the two copies' bounds checks had already drifted (functionally
 * equivalent, but only by accident) since #42/L5 needed a human to notice
 * and mirror a fix by hand. It stays IRAM_ATTR there for this call site.
 *
 * IRAM_ATTR (#78): makes the "never touch flash from the L2 hook" invariant
 * explicit rather than relying on CONFIG_LWIP_IRAM_OPTIMIZATION to have
 * caught it incidentally — that setting only covers lwIP's own component
 * sources, not this callback, which esp_eth invokes via a stored function
 * pointer (so it can't be inlined into anything already in IRAM). */
#if CONFIG_ADBLOCK_NET_ETH

/* (#109) Shared tail for both l2_input_cb reply paths (cache hit, blocked).
 * Both build their DNS payload directly into tx[dns..], at which point what
 * remains is identical: turn the copied request's Ethernet/IP/UDP headers
 * into a reply addressed back to the sender, patch the two length fields for
 * this payload's size, and redo the IP checksum (zeroed UDP checksum is
 * legal for IPv4 either way).
 *
 * Deliberately does NOT touch the DNS txid: the blocked path's payload was
 * memcpy'd from the original query (buf), so its txid is already correct;
 * the cached path's payload came from the forward cache and needs its own
 * one-line patch (tx[dns]=buf[dns]; tx[dns+1]=buf[dns+1];) BEFORE calling
 * this — folding that in here would mean every future caller either gets an
 * unwanted patch or has to know to undo it. Keeping it caller-side makes the
 * one real hazard in this consolidation (patch the wrong reply's txid, or
 * silently drop the patch) impossible to get wrong by construction. */
static void IRAM_ATTR l2_finish_reply(uint8_t *tx, int ihl, int udp, int payload_len)
{
    uint8_t t6[6];
    memcpy(t6, tx, 6); memcpy(tx, tx + 6, 6); memcpy(tx + 6, t6, 6);              /* swap MAC */
    uint8_t t4[4];
    memcpy(t4, tx+14+12, 4); memcpy(tx+14+12, tx+14+16, 4); memcpy(tx+14+16, t4, 4); /* swap IP */
    uint8_t t2[2];
    memcpy(t2, tx+udp, 2); memcpy(tx+udp, tx+udp+2, 2); memcpy(tx+udp+2, t2, 2);     /* swap ports */
    int iptot = ihl + 8 + payload_len;
    tx[14+2] = (iptot >> 8); tx[14+3] = (iptot & 0xFF);
    int udplen = 8 + payload_len;
    tx[udp+4] = (udplen >> 8); tx[udp+5] = (udplen & 0xFF);
    tx[udp+6] = 0; tx[udp+7] = 0;                     /* zero UDP checksum (legal IPv4) */
    tx[14+10] = 0; tx[14+11] = 0;                     /* IP checksum */
    uint32_t sum = 0;
    for (int i = 0; i < ihl; i += 2) sum += (tx[14+i] << 8) | tx[14+i+1];
    while (sum >> 16) sum = (sum & 0xFFFF) + (sum >> 16);
    uint16_t csum = ~sum;
    tx[14+10] = (csum >> 8); tx[14+11] = (csum & 0xFF);
}

static esp_err_t IRAM_ATTR l2_input_cb(esp_eth_handle_t h, uint8_t *buf, uint32_t len,
                             void *priv, void *info)
{
    (void)info;
    static uint8_t  tx[600];
    static char     name[256];
    do {
        /* Every `break` below hands the frame to lwIP unchanged, which is what
         * keeps this hook honest about the two-verdict-path rule: it may only
         * answer a query it can classify exactly as the socket path would, and
         * anything it cannot classify — a header it will not vouch for, a lock
         * it cannot take, a rewrite it must not render — falls through to the
         * socket path rather than being answered on a guess or dropped here. */
        uint32_t our_ip = s_eth_ip_nbo.load(std::memory_order_relaxed);
        if (!our_ip) break;                              /* (#106) no address yet */
        if (len < 14 + 20 + 8 + 13) break;               /* min IPv4/UDP/DNS */
        if (buf[12] != 0x08 || buf[13] != 0x00) break;   /* IPv4 only */
        if ((buf[14] >> 4) != 4) break;                  /* (#106) IP version nibble */
        int ihl = (buf[14] & 0x0F) * 4;
        if (ihl < 20 || buf[14 + 9] != 17) break;        /* UDP only */
        /* (#106) Length comes from the IP header, never from the frame: Ethernet
         * pads short frames to 60 bytes, so `len - dns` counted padding as DNS
         * payload, and an IP total-length larger than the frame was never
         * rejected at all. */
        int iptot = (buf[16] << 8) | buf[17];
        if (iptot < ihl + 8 || 14 + iptot > (int)len) break;
        /* (#106) Fragments: MF set or a non-zero offset means this frame is not
         * a whole datagram, so the bytes at the UDP/DNS offsets are not what
         * they look like. Reassembly is lwIP's job. */
        if (((buf[20] << 8) | buf[21]) & 0x3FFF) break;
        /* (#106) Only answer what is addressed to us. Without this the hook
         * replied to a query sent to the subnet broadcast — and, since it just
         * swaps the addresses back, replied FROM the broadcast address TO
         * whatever the source claimed to be. */
        uint32_t dst_ip;
        memcpy(&dst_ip, buf + 14 + 16, 4);
        if (dst_ip != our_ip) break;
        /* (#106) A source that cannot receive a unicast reply (0.0.0.0, the
         * all-ones broadcast, or 224/4 multicast) is not a client. */
        uint32_t src_hbo = ((uint32_t)buf[26] << 24) | ((uint32_t)buf[27] << 16) |
                           ((uint32_t)buf[28] << 8)  |  (uint32_t)buf[29];
        if (src_hbo == 0 || src_hbo == 0xFFFFFFFFu || (buf[26] & 0xF0) == 0xE0) break;
        /* (#87) The ACL guards the socket path but never this one, so a client
         * excluded from DNS still got blocked verdicts and cached answers over
         * Ethernet — the fast path only failed to answer on a cold miss, where
         * it fell through to the ACL-protected socket. Provable permission is
         * required to answer here; denied OR unknown defers to that socket,
         * which drops the query if it really is denied. */
        if (!acl_permits_nb(src_hbo)) break;
        /* (#48/#74) A client under a timed pause, or on the standing bypass
         * list, must get the real answer, which only the socket path can
         * fetch. Deferring here (rather than answering "not blocked") keeps
         * this hook's rule intact: it never forwards, and it never answers
         * on a verdict the socket path would override. The socket path
         * re-derives both from the same tables. */
        if (pause_active_for(src_hbo) || bypass_active_for_nb(src_hbo)) break;
        int udp = 14 + ihl;
        if (((buf[udp + 2] << 8) | buf[udp + 3]) != 53) break;   /* dst port 53 */
        int udplen = (buf[udp + 4] << 8) | buf[udp + 5];         /* (#106) */
        if (udplen < 8 + 12 || udp + udplen > 14 + iptot) break;
        int dns = udp + 8, dns_len = udplen - 8;
        if (buf[dns + 2] & 0x80) break;                  /* must be a query (QR=0) */
        if (((buf[dns + 4] << 8) | buf[dns + 5]) != 1) break;    /* qdcount==1 */
        size_t nlen = 0;
        int qend = dns_extract_qname(buf + dns, dns_len, 12, name, sizeof(name), &nlen);
        if (qend < 0) break;
        uint16_t qtype = (buf[dns + qend - 4] << 8) | buf[dns + qend - 3];
        if (qtype != 1 && qtype != 28) break;            /* A / AAAA only */
        uint16_t qclass = (buf[dns + qend - 2] << 8) | buf[dns + qend - 1];
        if (qclass != 1) break;                          /* (#106) class IN only */
        /* (#102) The socket path consults the rewrite table before the
         * blocklist, so a name that is both rewritten and blocklisted answers
         * with the configured address there — while this path went straight to
         * the blocklist and answered 0.0.0.0, making the verdict depend on
         * which transport the client happened to use. Test the same table here
         * and, on a match, defer: the answer is then built by the one
         * build_rewrite_a() in the socket path instead of a second copy in
         * IRAM. `-1` (table busy) defers too — same fail-to-the-slow-path rule
         * as everywhere else in this hook. */
        if (qtype == 1) {
            uint32_t rw = 0;
            if (rewrite_lookup_nb(name, nlen, &rw) != 0) break;
        }
        if (!blocklist_is_blocked_nb(name, nlen)) {      /* not blocked → try L2 cache, else lwIP */
            /* Forward-cache hit answered straight from L2, skipping lwIP — the
             * same socket-stack overhead the blocked path already bypasses. Lay
             * the eth+ip+udp headers into tx, then the seqlock-protected reader
             * copies the cached DNS reply right after them. Miss/race → lwIP. */
            int clen = dns_cache_l2_get(domain_hash(name, nlen), qtype,
                                        tx + dns, (int)sizeof(tx) - dns);
            if (clen <= 0) break;                        /* miss/expired/race → lwIP */
            memcpy(tx, buf, dns);                         /* eth+ip+udp headers */
            tx[dns] = buf[dns]; tx[dns+1] = buf[dns+1];   /* patch txid to this query */
            l2_finish_reply(tx, ihl, udp, clen);
            if (esp_eth_transmit(h, tx, dns + clen) != ESP_OK) s_l2_tx_fail++;
            s_l2_cached++;
            l2_log_stage(name, nlen, qtype, src_hbo, false);
            free(buf);                                    /* consumed (== eth_l2_free) */
            return ESP_OK;
        }

        /* ── craft blocked response in tx ── */
        int rdlen = (qtype == 28) ? 16 : 4;
        int dns_resp = qend + 12 + rdlen;                /* question + answer RR */
        int frame = dns + dns_resp;
        if (frame > (int)sizeof(tx)) break;
        memcpy(tx, buf, dns + qend);                     /* eth+ip+udp+dns(hdr+question) */
        { uint16_t qf = (buf[dns+2] << 8) | buf[dns+3];
          uint16_t rf = dns_resp_flags(qf, 0);
          tx[dns+2] = (rf >> 8); tx[dns+3] = (rf & 0xFF); }
        tx[dns+6] = 0; tx[dns+7] = 1;                    /* ancount=1 */
        tx[dns+8] = 0; tx[dns+9] = 0; tx[dns+10] = 0; tx[dns+11] = 0;  /* ns/ar=0 */
        uint8_t *a = tx + dns + qend;
        a[0]=0xC0; a[1]=0x0C; a[2]=(qtype>>8); a[3]=(qtype&0xFF);
        /* (#109) TTL shared with the socket path's BLOCKED_TTL_S (dns_server.h)
         * rather than a second hardcoded literal — the two verdict paths must
         * agree on how long a client caches a block, not just whether. */
        a[4]=0; a[5]=1;                                              /* class IN */
        a[6]=(BLOCKED_TTL_S>>24)&0xFF; a[7]=(BLOCKED_TTL_S>>16)&0xFF;
        a[8]=(BLOCKED_TTL_S>>8)&0xFF;  a[9]=BLOCKED_TTL_S&0xFF;      /* ttl */
        a[10]=(rdlen>>8); a[11]=(rdlen&0xFF);
        memset(a+12, 0, rdlen);                          /* 0.0.0.0 / :: */
        l2_finish_reply(tx, ihl, udp, dns_resp);

        if (esp_eth_transmit(h, tx, frame) != ESP_OK) s_l2_tx_fail++;
        s_l2_blocked++;
        l2_log_stage(name, nlen, qtype, src_hbo, true);
        free(buf);                                       /* we consumed it (== eth_l2_free) */
        return ESP_OK;
    } while (0);

