GlomarGadaffi/ESP32_AdBlocker_Reborn/main/dns_sink.cpp
    s_l2_fallthrough++;   /* (#77) every `break` above lands here — link is alive */
    return esp_netif_receive((esp_netif_t *)priv, buf, len, NULL);
}
#endif /* CONFIG_ADBLOCK_NET_ETH — L2 fast-path hook */

/* Init-failure halt, made OTA-rollback-aware (#1). Plain portMAX_DELAY halt
 * loops here would defeat CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE: rollback
 * only fires on the NEXT reset, and a halted board never resets, so a bad OTA
 * image that fails init would hang forever on the safety net instead of being
 * reverted by it. If the running partition is still ESP_OTA_IMG_PENDING_VERIFY
 * (a freshly-OTA'd image that never reached esp_ota_mark_app_valid_cancel_
 * rollback below), roll back and reboot immediately instead of halting.
 * On an already-confirmed partition (state != PENDING_VERIFY — normal boot,
 * hardware fault unrelated to OTA) there's nothing safe to roll back to, so
 * this still just halts, same as before. */
static void halt_or_rollback(const char *reason)
{
    ESP_LOGE(TAG, "%s — halting", reason);
    esp_ota_img_states_t state;
    const esp_partition_t *running = esp_ota_get_running_partition();
    if (running && esp_ota_get_state_partition(running, &state) == ESP_OK &&
        state == ESP_OTA_IMG_PENDING_VERIFY) {
        ESP_LOGE(TAG, "unconfirmed OTA image — rolling back to the previous slot");
        esp_ota_mark_app_invalid_rollback_and_reboot();   /* does not return on success */
    }
    for (;;) vTaskDelay(portMAX_DELAY);
}

/* ── app_main ────────────────────────────────────────────────────── */
extern "C" void app_main(void)
{
    /* (#71) First thing, before anything else can plausibly reset or reason
     * about the RTC-memory breadcrumb: snapshot whatever the last boot left
     * behind and classify why we're here. Needs no NVS, no PSRAM, no clock. */
    crashlog_init();

    /* NVS */
    esp_err_t r = nvs_flash_init();
    if (r == ESP_ERR_NVS_NO_FREE_PAGES || r == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        r = nvs_flash_init();
    }
    ESP_ERROR_CHECK(r);

    /* #75: seed the clock from max(last-known-good NVS epoch, build stamp)
     * BEFORE anything can open a TLS connection. Certificate not-before /
     * not-after checks read the system clock, and until this ran that clock
     * said 1970 — the earliest possible point after NVS is the only place this
     * belongs. It is a floor, not a sync: timesync_is_synced() stays false, so
     * the query log and web UI still refuse to date anything until NTP lands. */
    timesync_floor_init();

    /* Event loop + netif */
    ESP_ERROR_CHECK(esp_event_loop_create_default());
    ESP_ERROR_CHECK(esp_netif_init());

    s_eth_eg = xEventGroupCreate();

    ESP_ERROR_CHECK(esp_event_handler_register(IP_EVENT, ESP_EVENT_ANY_ID,
                                               ip_event_handler, nullptr));

#if CONFIG_ADBLOCK_NET_ETH
    /* Register Ethernet event handler */
    ESP_ERROR_CHECK(esp_event_handler_register(ETH_EVENT, ESP_EVENT_ANY_ID,
                                               eth_event_handler, nullptr));

    /* Init W5500 + create default Ethernet netif (DHCP client). Always brought
     * up — the L2 fast-path and LAN-facing IP (mDNS, router DNS target, web UI)
     * live here regardless of whether Wi-Fi is also enabled. */
    esp_eth_handle_t eth_handle = eth_init_w5500();
    esp_netif_config_t netif_cfg = ESP_NETIF_DEFAULT_ETH();
    esp_netif_t *eth_netif = esp_netif_new(&netif_cfg);
    esp_netif_attach(eth_netif, esp_eth_new_netif_glue(eth_handle));
    /* Override the glue's input with our L2 fast-path hook (passthrough for now) */
    ESP_ERROR_CHECK(esp_eth_update_input_path_info(eth_handle, l2_input_cb, eth_netif));

    /* Static IP (#55): the netif has to be configured before the driver starts
     * (see apply_static_ip), but the address is only *published* once the link
     * actually comes up — publish_static_eth, from the event handler (#56). */
    netcfg_load("eth", &s_eth_static);
    if (!s_eth_static.dhcp)
        apply_static_ip(eth_netif, s_eth_static);
    ESP_ERROR_CHECK(esp_eth_start(eth_handle));
#else
    /* (#49) Wi-Fi-only board: no W5500, no L2 hook, no SD. The Wi-Fi STA below
     * is the LAN-facing interface; every query takes the lwIP socket path. */
    ESP_LOGI(TAG, "%s: Wi-Fi is the only link (no Ethernet, no SD card)", BOARD_NAME);
#endif

#if CONFIG_ADBLOCK_NET_WIFI
    /* Wi-Fi STA bring-up alongside Ethernet (#53: dual-WAN). No L2 fast-path
     * here — Wi-Fi queries take the normal lwIP socket path. */
    wifi_init_sta();

    /* Wait for EITHER interface, not both — the Ethernet cable may not be
     * plugged in at all (Wi-Fi-only operation is a supported mode, not just
     * a transient boot state), so blocking on both would hang forever with
     * no cable connected. Whichever interface comes up later still fires its
     * own IP_EVENT and joins in (apply_upstream_iface() re-runs each time).
     *
     * Bounded, not portMAX_DELAY (#1): a board with no Ethernet cable AND no
     * working Wi-Fi credentials (blank first boot, or a changed home network)
     * would otherwise hang HERE forever — nothing past this line ever runs,
     * including web_ui_start(), so the only recovery was the USB serial
     * console. On timeout, bring up the setup AP (start_setup_ap) so the
     * device is reachable over Wi-Fi with zero prior config — mirrors
     * upstream ESP32_AdBlocker's own AP-mode bootstrap — then give it one
     * more bounded window before continuing regardless: booting with no
     * upstream reachable yet is already a supported state (see Wi-Fi-only,
     * no-cable above), just newly reachable via the AP instead of USB. */
    ESP_LOGI(TAG, "Waiting for Ethernet or Wi-Fi link and DHCP...");
    EventBits_t link_bits = xEventGroupWaitBits(s_eth_eg, ETH_GOT_IP_BIT | WIFI_GOT_IP_BIT,
                        pdFALSE, pdFALSE, pdMS_TO_TICKS(WIFI_SETUP_AP_TIMEOUT_MS));
    if (!(link_bits & (ETH_GOT_IP_BIT | WIFI_GOT_IP_BIT))) {
        start_setup_ap();
        xEventGroupWaitBits(s_eth_eg, ETH_GOT_IP_BIT | WIFI_GOT_IP_BIT,
                            pdFALSE, pdFALSE, pdMS_TO_TICKS(WIFI_SETUP_AP_TIMEOUT_MS));
    }
    ESP_LOGI(TAG, "Network ready — Ethernet: %s  Wi-Fi: %s",
             s_ip[0] ? s_ip : "(down)", s_wifi_ip[0] ? s_wifi_ip : "(down)");
#else
    /* Wait for link + DHCP lease */
    ESP_LOGI(TAG, "Waiting for Ethernet link and DHCP...");
    xEventGroupWaitBits(s_eth_eg, ETH_CONNECTED_BIT | ETH_GOT_IP_BIT,
                        pdFALSE, pdTRUE, portMAX_DELAY);
    ESP_LOGI(TAG, "Network ready — IP: %s", s_ip);
#endif

    upstream_iface_init_nvs();

