GlomarGadaffi/ESP32_AdBlocker_Reborn/main/dns_sink.cpp
#if CONFIG_ADBLOCK_NET_WIFI
    /* #80: the wait above returns as soon as EITHER interface has an IP - that
     * is deliberate, since a cable-out Wi-Fi-only boot is a supported mode, not
     * just a transient. But it means a fast Wi-Fi lease can let us proceed
     * while the interface we actually egress through is still waiting on DHCP,
     * which made the banner below report a fallback resolver and advertise the
     * wrong LAN IP. Give the SELECTED interface a bounded second chance; a
     * genuinely absent link still boots, it just says so out loud. */
    {
        const EventBits_t want = (strcmp(s_upstream_iface, "wifi") == 0)
                               ? WIFI_GOT_IP_BIT : ETH_GOT_IP_BIT;
        if (!(xEventGroupGetBits(s_eth_eg) & want)) {
            ESP_LOGI(TAG, "Upstream interface (%s) has no lease yet - waiting up to %d s",
                     s_upstream_iface, UPSTREAM_IFACE_WAIT_MS / 1000);
            EventBits_t got = xEventGroupWaitBits(s_eth_eg, want, pdFALSE, pdFALSE,
                                                  pdMS_TO_TICKS(UPSTREAM_IFACE_WAIT_MS));
            if (!(got & want))
                ESP_LOGW(TAG, "Upstream interface (%s) still has no lease after %d s - "
                              "starting on the fallback resolver; it re-points "
                              "automatically when DHCP lands",
                         s_upstream_iface, UPSTREAM_IFACE_WAIT_MS / 1000);
        }
    }
#endif

    /* (raw W5500 TX floor measured at ~400us/frame, 2497fps — bus has ~5x
     *  headroom over our ~527qps; the gap is the lwIP per-query path.) */

    /* SNTP: get real wall-clock time so the query log carries dated timestamps.
     * Lightweight built-in lwIP SNTP (one UDP socket). Resolves via the board's
     * own DHCP DNS, not our sinkhole, so it works even before the blocklist loads.
     *
     * #75 moved this up from after web_ui_start(): it only needs an IP and the
     * DHCP resolver, both of which are true here, and starting it this early
     * shortens the window in which TLS clients (DoT on the DNS task, the
     * blocklist fetch) are running on the floor rather than on real time. */
    timesync_start();

    /* Allocate PSRAM ping-pong buffers */
    if (!blocklist_init()) {
        halt_or_rollback("PSRAM blocklist init failed");
    }
    rewrite_init();
    localzone_init_nvs();
    dot_init_nvs();
    acl_init();
    bypass_init();
    pause_init();
    query_log_init();

#if CONFIG_ADBLOCK_NET_ETH
    /* Mount SD card (SPI3 — separate bus from W5500) */
    sd_mount();
#endif

    /* Start DNS sinkhole (Core 1, priority 10). Upstream = the DHCP-provided
     * DNS server for whichever interface is selected (see pick_upstream /
     * apply_upstream_iface — #53). Switchable live from the web UI afterwards
     * without restarting this task. */
    const char *upstream = pick_upstream(s_eth_dns, s_gw);
#if CONFIG_ADBLOCK_NET_WIFI
    if (strcmp(s_upstream_iface, "wifi") == 0)
        upstream = pick_upstream(s_wifi_dns, s_wifi_gw);
#endif
    if (!s_dns.start(upstream)) {
        halt_or_rollback("DNS server start failed");
    }
    /* #80: start() unconditionally overwrites _upstream_ip, so an IP event
     * landing between the pick_upstream() read above and start() would have its
     * set_upstream() silently discarded, with nothing left to re-fire it. The
     * window is microseconds - not the failure we observed - but re-applying
     * once here makes the final upstream derive from current interface state
     * regardless of interleaving, and hands the banner the live value instead
     * of one computed before the task existed. */
    {
        const char *live = apply_upstream_iface();

        const char *lan_ip = "(no IP yet)";
        const char *lan_if = "";
        if (s_ip[0]) { lan_ip = s_ip; lan_if = " (Ethernet)"; }
#if CONFIG_ADBLOCK_NET_WIFI
        else if (s_wifi_ip[0]) { lan_ip = s_wifi_ip; lan_if = " (Wi-Fi)"; }
#endif
        ESP_LOGI(TAG, "DNS sinkhole active (upstream via %s: %s). Point your router's DNS at %s%s",
                 s_upstream_iface, live, lan_ip, lan_if);
    }

    /* Start web UI (HTTPS :443, :80 redirects) */
    bool ui_up = web_ui_start(&s_dns);

    /* OTA rollback confirmation (#1): CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE
     * boots a freshly-flashed OTA slot in a "pending verify" state and
     * reverts to the previous slot on the NEXT reset unless something marks
     * it valid first. DNS serving + the web UI both being up is as good a
     * health signal as this device has — no display, no separate healthcheck
     * endpoint to call. If either of them had failed to reach this point
     * (crash, hang, halt-loop above), this line never runs and the next
     * power cycle rolls back automatically.
     *
     * A UI that failed to start (no TLS identity, httpd_ssl_start failure)
     * is a confirmed image with no way to see it from the network, so on an
     * unverified image that's a rollback, not a confirmation. On an already
     * confirmed image DNS keeps serving and the USB console is the way in —
     * never halt_or_rollback() there: a cert problem is not a reason to stop
     * resolving. */
    if (!ui_up) {
        const esp_partition_t *run = esp_ota_get_running_partition();
        esp_ota_img_states_t st;
        if (run && esp_ota_get_state_partition(run, &st) == ESP_OK && st == ESP_OTA_IMG_PENDING_VERIFY) {
            ESP_LOGE(TAG, "web UI failed on an unverified image — rolling back");
            esp_ota_mark_app_invalid_rollback_and_reboot();
        }
        ESP_LOGE(TAG, "web UI failed to start — DNS keeps serving; USB console for recovery");
    } else {
        esp_ota_mark_app_valid_cancel_rollback();
    }

    /* mDNS: advertise the per-board hostname and expose the HTTP service (#20) */
    if (mdns_init() == ESP_OK) {
        mdns_hostname_set(MDNS_HOSTNAME);
        mdns_instance_name_set("ESP32 AdBlocker");
        mdns_service_add(nullptr, "_https", "_tcp", 443, nullptr, 0);
        ESP_LOGI(TAG, "mDNS: reachable at " MDNS_HOSTNAME ".local");
    }

    /* Launch blocklist download + 4h reload (Core 0, priority 2).
     * 24KB stack: mbedTLS (HTTPS fetch) + FATFS (SD save) are both deep. */
    xTaskCreatePinnedToCore(download_task, "bl_download", 24576, nullptr, 2, nullptr, 0);

    /* USB recovery console: rescue a headless board over the flash cable. */
    console_start();

    ESP_LOGI(TAG, "Startup complete. Ethernet: %s  Wi-Fi: %s — either can be set as your DNS server.",
#if CONFIG_ADBLOCK_NET_ETH
             s_ip[0] ? s_ip : "(down)",
#else
             "(not built)",
#endif
#if CONFIG_ADBLOCK_NET_WIFI
             s_wifi_ip[0] ? s_wifi_ip : "(down)");
#else
             "(not built)");
#endif
}
